update arch.md file
